DeviceFileEvents
| where FileName matches regex @"(?i).*openssl.*"
| join kind=inner (
    DeviceTvmSoftwareInventory
    | where SoftwareVersion matches regex @"^1\.1."
    | summarize by DeviceName, SoftwareVersion
) on $left.DeviceName == $right.DeviceName
| union (
    DeviceFileEvents
    | where FileName matches regex @"(?i).*openssl."
    | join kind=inner (
        DeviceTvmSoftwareVulnerabilities
        | where CveId in (
            "CVE-2023-2975", "CVE-2022-3602", "CVE-2023-0401", "CVE-2023-0217", "CVE-2023-2650", 
            "CVE-2023-4807", "CVE-2022-4450", "CVE-2022-4203", "CVE-2023-0286", "CVE-2022-3358", 
            "CVE-2023-0464", "CVE-2023-0465", "CVE-2022-3786", "CVE-2022-4304", "CVE-2023-0466", 
            "CVE-2023-3817", "CVE-2022-3996", "CVE-2023-0216", "CVE-2023-1255", "CVE-2023-0215"
        )
    ) on $left.DeviceName == $right.DeviceName
)
| project DeviceName, FileName, FolderPath, SoftwareName, SoftwareVersion, CveId
